from datetime import date

#дата дня рождения

d = int(input("напишите день вашего рождения - "))
m = int(input("напишите месяц вашего рождения (без нуля (например сентябрь не 09 а 9)) - "))
y = int(input("напишите год вашего рождения (или год следующего дня рождения что бы узнать сколько до него) - "))

dr = date(y, m, d) #дата рождения в формате ГГГГ-ММ-ДД

td = date.today() #сегодняшняя в формате ГГГГ-ММ-ДД

opr = int(input("выберите 1 для нахождения разницы от др до нынешнего момента или 2(если вначале написали год следующего др) для нахождения кол-ва дней до др - ")) #выбор найти колличество дней до др или после

if opr == 1:
    raz = td - dr #расчет сколько дней прошло с момента др
    print("С момента вашего рождения прошло", raz)
else:
        dodr = dr - td #расчет через сколько дней др
        print("До Вашего дня рождения осталось", dodr)
